在 Jupyter notebook 中使用 xeus-sql 時，每個 cell 只能執行一條 SQL 語句。如果你想要在同一個 cell 中執行多條 SQL 語句，你需要將這些語句包裹在一個 BEGIN/COMMIT 區塊中，像這樣：

In [ ]:
BEGIN;
-- 你的第一條語句
SELECT * FROM movies LIMIT 5;
-- 你的第二條語句
SELECT * FROM actors LIMIT 5;
COMMIT;

In [1]:
%LOAD sqlite3 db=../databases/imdb.db timeout=2 shared_cache=true

In [48]:
ATTACH "../databases/nba.db" AS nba;

In [49]:
ATTACH "../databases/twElection2020.db" AS twElection2020;

In [50]:
ATTACH "../databases/covid19.db" AS covid19;

In [2]:
SELECT 'Hello, World!';

+-----------------+
| 'Hello, World!' |
+-----------------+
| Hello, World!   |
+-----------------+
1 row in set (0.00 sec)

In [3]:
SELECT *
  FROM actors
 LIMIT 5;

+----+--------------------+
| id | name               |
+----+--------------------+
| 1  | Aamir Khan         |
+----+--------------------+
| 2  | Aaron Eckhart      |
+----+--------------------+
| 3  | Aaron Lazar        |
+----+--------------------+
| 4  | Abbas-Ali Roomandi |
+----+--------------------+
| 5  | Abbey Lee          |
+----+--------------------+
5 rows in set (0.00 sec)

In [4]:
SELECT *
  FROM PRAGMA_TABLE_INFO('actors');

+-----+------+---------+---------+------------+----+
| cid | name | type    | notnull | dflt_value | pk |
+-----+------+---------+---------+------------+----+
| 0   | id   | INTEGER | 0       | NULL       | 1  |
+-----+------+---------+---------+------------+----+
| 1   | name | TEXT    | 0       | NULL       | 0  |
+-----+------+---------+---------+------------+----+
2 rows in set (0.00 sec)

In [5]:
SELECT 5566,
       TYPEOF(5566);

+------+--------------+
| 5566 | TYPEOF(5566) |
+------+--------------+
| 5566 | integer      |
+------+--------------+
1 row in set (0.00 sec)

In [6]:
SELECT 2.718,
       TYPEOF(2.718);

+-------+---------------+
| 2.718 | TYPEOF(2.718) |
+-------+---------------+
| 2.718 | real          |
+-------+---------------+
1 row in set (0.00 sec)

In [7]:
SELECT 'Hello, World!',
       TYPEOF('Hello, World!');

+-----------------+-------------------------+
| 'Hello, World!' | TYPEOF('Hello, World!') |
+-----------------+-------------------------+
| Hello, World!   | text                    |
+-----------------+-------------------------+
1 row in set (0.00 sec)

In [10]:
SELECT NULL,
       TYPEOF(NULL);

+------+--------------+
| NULL | TYPEOF(NULL) |
+------+--------------+
| NULL | null         |
+------+--------------+
1 row in set (0.00 sec)

In [27]:
SELECT *
  FROM movies   -- end of line comment
 LIMIT 1; 
 
 -- single line comment
 
 /*
multiple-line comments...
multiple-line comments...
multiple-line comments...
*/

+----+--------------------------+--------------+--------+----------------+---------+
| id | title                    | release_year | rating | director       | runtime |
+----+--------------------------+--------------+--------+----------------+---------+
| 1  | The Shawshank Redemption | 1994         | 9.3    | Frank Darabont | 142     |
+----+--------------------------+--------------+--------+----------------+---------+
1 row in set (0.00 sec)

https://github.com/jupyter-xeus/xeus-sql/issues/63 <br>
官網有解決postgres 的問題的樣子
不過不知道是否修改部分與sqlite無關，所以sqlite部分沒變? <br>
postgres是linux系統的(至少conda中套件只有linux和Mac)，因此可能核心部分不同。

In [28]:
  --  comment 放在上方好像會使結果不顯示?原因不明
SELECT *
  FROM movies 
 LIMIT 5;

In [59]:
SELECT COUNT(*) FROM movies;

+----------+
| COUNT(*) |
+----------+
| 250      |
+----------+
1 row in set (0.00 sec)

In [60]:
 --  comment 放在上方好像會使結果不顯示?原因不明
 SELECT COUNT(*) FROM movies;

In [29]:
SELECT *
  FROM movies
 LIMIT 3;

+----+--------------------------+--------------+--------+----------------------+---------+
| id | title                    | release_year | rating | director             | runtime |
+----+--------------------------+--------------+--------+----------------------+---------+
| 1  | The Shawshank Redemption | 1994         | 9.3    | Frank Darabont       | 142     |
+----+--------------------------+--------------+--------+----------------------+---------+
| 2  | The Godfather            | 1972         | 9.2    | Francis Ford Coppola | 175     |
+----+--------------------------+--------------+--------+----------------------+---------+
| 3  | The Dark Knight          | 2008         | 9      | Christopher Nolan    | 152     |
+----+--------------------------+--------------+--------+----------------------+---------+
3 rows in set (0.00 sec)

In [30]:
SELECT *
  FROM movies
 LIMIT 5;

+----+--------------------------+--------------+--------+----------------------+---------+
| id | title                    | release_year | rating | director             | runtime |
+----+--------------------------+--------------+--------+----------------------+---------+
| 1  | The Shawshank Redemption | 1994         | 9.3    | Frank Darabont       | 142     |
+----+--------------------------+--------------+--------+----------------------+---------+
| 2  | The Godfather            | 1972         | 9.2    | Francis Ford Coppola | 175     |
+----+--------------------------+--------------+--------+----------------------+---------+
| 3  | The Dark Knight          | 2008         | 9      | Christopher Nolan    | 152     |
+----+--------------------------+--------------+--------+----------------------+---------+
| 4  | The Godfather Part II    | 1974         | 9      | Francis Ford Coppola | 202     |
+----+--------------------------+--------------+--------+----------------------+---------+
| 5  | 12 Angry Men             | 1957         | 9      | Sidney Lumet         | 96      |
+----+--------------------------+--------------+--------+----------------------+---------+
5 rows in set (0.00 sec)

In [31]:
SELECT title
  FROM movies
 LIMIT 5;

+--------------------------+
| title                    |
+--------------------------+
| The Shawshank Redemption |
+--------------------------+
| The Godfather            |
+--------------------------+
| The Dark Knight          |
+--------------------------+
| The Godfather Part II    |
+--------------------------+
| 12 Angry Men             |
+--------------------------+
5 rows in set (0.00 sec)

In [32]:
SELECT title,
       release_year,
       director
  FROM movies
 LIMIT 5;

+--------------------------+--------------+----------------------+
| title                    | release_year | director             |
+--------------------------+--------------+----------------------+
| The Shawshank Redemption | 1994         | Frank Darabont       |
+--------------------------+--------------+----------------------+
| The Godfather            | 1972         | Francis Ford Coppola |
+--------------------------+--------------+----------------------+
| The Dark Knight          | 2008         | Christopher Nolan    |
+--------------------------+--------------+----------------------+
| The Godfather Part II    | 1974         | Francis Ford Coppola |
+--------------------------+--------------+----------------------+
| 12 Angry Men             | 1957         | Sidney Lumet         |
+--------------------------+--------------+----------------------+
5 rows in set (0.00 sec)

In [33]:
SELECT 'Hello, World!' AS hello_world,
       TYPEOF('Hello, World!') AS typeof_hello_world;

+---------------+--------------------+
| hello_world   | typeof_hello_world |
+---------------+--------------------+
| Hello, World! | text               |
+---------------+--------------------+
1 row in set (0.00 sec)

In [34]:
SELECT title AS movie,
       release_year AS released_in,
       director AS directed_by
  FROM movies
 LIMIT 5;

+--------------------------+-------------+----------------------+
| movie                    | released_in | directed_by          |
+--------------------------+-------------+----------------------+
| The Shawshank Redemption | 1994        | Frank Darabont       |
+--------------------------+-------------+----------------------+
| The Godfather            | 1972        | Francis Ford Coppola |
+--------------------------+-------------+----------------------+
| The Dark Knight          | 2008        | Christopher Nolan    |
+--------------------------+-------------+----------------------+
| The Godfather Part II    | 1974        | Francis Ford Coppola |
+--------------------------+-------------+----------------------+
| 12 Angry Men             | 1957        | Sidney Lumet         |
+--------------------------+-------------+----------------------+
5 rows in set (0.00 sec)

In [35]:
SELECT director
  FROM movies
 LIMIT 10;

+----------------------+
| director             |
+----------------------+
| Frank Darabont       |
+----------------------+
| Francis Ford Coppola |
+----------------------+
| Christopher Nolan    |
+----------------------+
| Francis Ford Coppola |
+----------------------+
| Sidney Lumet         |
+----------------------+
| Steven Spielberg     |
+----------------------+
| Peter Jackson        |
+----------------------+
| Quentin Tarantino    |
+----------------------+
| Peter Jackson        |
+----------------------+
| Sergio Leone         |
+----------------------+
10 rows in set (0.00 sec)

In [36]:
SELECT DISTINCT director
  FROM movies
 LIMIT 10;

+----------------------+
| director             |
+----------------------+
| Frank Darabont       |
+----------------------+
| Francis Ford Coppola |
+----------------------+
| Christopher Nolan    |
+----------------------+
| Sidney Lumet         |
+----------------------+
| Steven Spielberg     |
+----------------------+
| Peter Jackson        |
+----------------------+
| Quentin Tarantino    |
+----------------------+
| Sergio Leone         |
+----------------------+
| Robert Zemeckis      |
+----------------------+
| David Fincher        |
+----------------------+
10 rows in set (0.00 sec)

In [37]:
SELECT DISTINCT director, title
  FROM movies
 LIMIT 10;

+----------------------+---------------------------------------------------+
| director             | title                                             |
+----------------------+---------------------------------------------------+
| Frank Darabont       | The Shawshank Redemption                          |
+----------------------+---------------------------------------------------+
| Francis Ford Coppola | The Godfather                                     |
+----------------------+---------------------------------------------------+
| Christopher Nolan    | The Dark Knight                                   |
+----------------------+---------------------------------------------------+
| Francis Ford Coppola | The Godfather Part II                             |
+----------------------+---------------------------------------------------+
| Sidney Lumet         | 12 Angry Men                                      |
+----------------------+---------------------------------------------------+
| Steven Spielberg     | Schindler's List                                  |
+----------------------+---------------------------------------------------+
| Peter Jackson        | The Lord of the Rings: The Return of the King     |
+----------------------+---------------------------------------------------+
| Quentin Tarantino    | Pulp Fiction                                      |
+----------------------+---------------------------------------------------+
| Peter Jackson        | The Lord of the Rings: The Fellowship of the Ring |
+----------------------+---------------------------------------------------+
| Sergio Leone         | The Good, the Bad and the Ugly                    |
+----------------------+---------------------------------------------------+
10 rows in set (0.00 sec)

In [39]:
Select title, release_year,
       rating
from movies liMiT 5;

+--------------------------+--------------+--------+
| title                    | release_year | rating |
+--------------------------+--------------+--------+
| The Shawshank Redemption | 1994         | 9.3    |
+--------------------------+--------------+--------+
| The Godfather            | 1972         | 9.2    |
+--------------------------+--------------+--------+
| The Dark Knight          | 2008         | 9      |
+--------------------------+--------------+--------+
| The Godfather Part II    | 1974         | 9      |
+--------------------------+--------------+--------+
| 12 Angry Men             | 1957         | 9      |
+--------------------------+--------------+--------+
5 rows in set (0.00 sec)

In [40]:
SELECT DISTINCT director AS distinct_director
  FROM movies
 LIMIT 10;

+----------------------+
| distinct_director    |
+----------------------+
| Frank Darabont       |
+----------------------+
| Francis Ford Coppola |
+----------------------+
| Christopher Nolan    |
+----------------------+
| Sidney Lumet         |
+----------------------+
| Steven Spielberg     |
+----------------------+
| Peter Jackson        |
+----------------------+
| Quentin Tarantino    |
+----------------------+
| Sergio Leone         |
+----------------------+
| Robert Zemeckis      |
+----------------------+
| David Fincher        |
+----------------------+
10 rows in set (0.00 sec)

# Exercise

In [51]:
SELECT *
  FROM admin_regions
 LIMIT 5;

+----+-----------+-----------+-----------+
| id | county    | town      | village   |
+----+-----------+-----------+-----------+
| 1  | 南投縣 | 中寮鄉 | 中寮村 |
+----+-----------+-----------+-----------+
| 2  | 南投縣 | 中寮鄉 | 內城村 |
+----+-----------+-----------+-----------+
| 3  | 南投縣 | 中寮鄉 | 八仙村 |
+----+-----------+-----------+-----------+
| 4  | 南投縣 | 中寮鄉 | 和興村 |
+----+-----------+-----------+-----------+
| 5  | 南投縣 | 中寮鄉 | 崁頂村 |
+----+-----------+-----------+-----------+
5 rows in set (0.00 sec)

In [52]:
SELECT *
  FROM twElection2020.admin_regions
 LIMIT 5;

+----+-----------+-----------+-----------+
| id | county    | town      | village   |
+----+-----------+-----------+-----------+
| 1  | 南投縣 | 中寮鄉 | 中寮村 |
+----+-----------+-----------+-----------+
| 2  | 南投縣 | 中寮鄉 | 內城村 |
+----+-----------+-----------+-----------+
| 3  | 南投縣 | 中寮鄉 | 八仙村 |
+----+-----------+-----------+-----------+
| 4  | 南投縣 | 中寮鄉 | 和興村 |
+----+-----------+-----------+-----------+
| 5  | 南投縣 | 中寮鄉 | 崁頂村 |
+----+-----------+-----------+-----------+
5 rows in set (0.00 sec)

In [53]:
SELECT confName, divName, fullName
  FROM nba.teams
 LIMIT 10;

+----------+-----------+-----------------------+
| confName | divName   | fullName              |
+----------+-----------+-----------------------+
| East     | Southeast | Atlanta Hawks         |
+----------+-----------+-----------------------+
| East     | Atlantic  | Boston Celtics        |
+----------+-----------+-----------------------+
| East     | Central   | Cleveland Cavaliers   |
+----------+-----------+-----------------------+
| West     | Southwest | New Orleans Pelicans  |
+----------+-----------+-----------------------+
| East     | Central   | Chicago Bulls         |
+----------+-----------+-----------------------+
| West     | Southwest | Dallas Mavericks      |
+----------+-----------+-----------------------+
| West     | Northwest | Denver Nuggets        |
+----------+-----------+-----------------------+
| West     | Pacific   | Golden State Warriors |
+----------+-----------+-----------------------+
| West     | Southwest | Houston Rockets       |
+----------+-----------+-----------------------+
| West     | Pacific   | LA Clippers           |
+----------+-----------+-----------------------+
10 rows in set (0.00 sec)

In [54]:
SELECT firstName, lastName
  FROM nba.players
 LIMIT 5;

+-----------+----------+
| firstName | lastName |
+-----------+----------+
| LeBron    | James    |
+-----------+----------+
| Carmelo   | Anthony  |
+-----------+----------+
| Udonis    | Haslem   |
+-----------+----------+
| Dwight    | Howard   |
+-----------+----------+
| Andre     | Iguodala |
+-----------+----------+
5 rows in set (0.00 sec)

In [ ]:
SELECT firstName AS first_name,
       lastName AS last_name
  FROM players
 LIMIT 5;

In [57]:
SELECT DISTINCT county AS distinct_counties
  FROM twElection2020.admin_regions;

+-------------------+
| distinct_counties |
+-------------------+
| 南投縣         |
+-------------------+
| 嘉義市         |
+-------------------+
| 嘉義縣         |
+-------------------+
| 基隆市         |
+-------------------+
| 宜蘭縣         |
+-------------------+
| 屏東縣         |
+-------------------+
| 彰化縣         |
+-------------------+
| 新北市         |
+-------------------+
| 新竹市         |
+-------------------+
| 新竹縣         |
+-------------------+
| 桃園市         |
+-------------------+
| 澎湖縣         |
+-------------------+
| 臺中市         |
+-------------------+
| 臺北市         |
+-------------------+
| 臺南市         |
+-------------------+
| 臺東縣         |
+-------------------+
| 花蓮縣         |
+-------------------+
| 苗栗縣         |
+-------------------+
| 連江縣         |
+-------------------+
| 金門縣         |
+-------------------+
| 雲林縣         |
+-------------------+
| 高雄市         |
+-------------------+
22 rows in set (0.00 sec)

In [58]:
SELECT DISTINCT divName AS distinct_divisions
  FROM nba.teams;

+--------------------+
| distinct_divisions |
+--------------------+
| Southeast          |
+--------------------+
| Atlantic           |
+--------------------+
| Central            |
+--------------------+
| Southwest          |
+--------------------+
| Northwest          |
+--------------------+
| Pacific            |
+--------------------+
6 rows in set (0.00 sec)